# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
# tap "osx-cross/arm"
# tap "osx-cross/avr"
# tap "qmk/qmk"

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "git-lfs"
brew "zsh"
brew "spaceship"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "node"
brew "tree-sitter"
brew "neovim"
brew "coreutils"
brew "jq"
brew "nvm"
brew "tree"
brew "lsd"
brew "launch"
brew "fzf"
brew "fpp"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
# brew "wifi-password"
# brew "speedtest"
brew "bat"
# brew "trash-it"
# brew "youtube-dl"
brew "watchman" # Watching files for Jest
brew "diff-so-fancy"
brew "transmission-cli"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# Utils
# cask "ukrainian-typographic-keyboard"
cask "gpg-suite"
# cask "openvpn-connect"
# brew "qmk/qmk/qmk"
# cask "karabiner-elements"

# Development
cask "sf"
brew "shfmt"
brew "trunk"
brew "openjdk@11"
brew "python@3.11"
# brew "lua"
# brew "lua-language-server"
# brew "luacheck"
# cask "fig"
# cask "multipass"
cask "iterm2"
cask "visual-studio-code"
cask "github"
cask "hammerspoon"
cask "hazeover"
cask "jetbrains-toolbox"

# Desktop applications
cask "appcleaner"
cask "logitune"
# cask "moom"
# cask "telegram"
# cask "google-chrome"
# cask "firefox"
# cask "brave-browser"
# cask "slack"
cask "steam"
cask "spotify"
cask "spotmenu"
# cask "notion"
# cask "discord"
cask "swift-quit"
cask "the-unarchiver"
cask "via"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Amphetamine", id: 937984704
mas "Home Assistant", id: 1099568401
# mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "Paste", id: 967805235
# mas "Posture Pal", id: 1590316152
# mas "Sequence Diagram", id: 1195426709
mas "Snap", id: 418073146
mas "StopTheMadness", id: 1376402589
mas "Typist", id: 415166115
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
