# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "nvim"
brew "node"
brew "coreutils"
brew "nvm"
brew "tree"
brew "eza"
brew "zoxide"
brew "fzf"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
brew "wifi-password"
brew "speedtest"
brew "bat"
brew "trash-it"
brew "youtube-dl"
brew "watchman" # Watching files for Jest

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"

# Utils
cask "raycast"
cask "ukrainian-typographic-keyboard"
cask "gpg-suite"
cask "openvpn-connect"

# Media
cask "transmission"
cask "handbrake"
cask "vlc"
cask "obs"

# Development
cask "multipass"
cask "iterm2"
cask "visual-studio-code"
cask "github"
cask "ghostty"

# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "slack"
cask "steam"
cask "spotify"
cask "notion"
cask "discord"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Home Assistant", id: 1099568401
mas "Bitwarden", id: 1352778147
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 12848638472
mas "NordVPN", id: 905953485
mas "The Unarchiver",  id: 425424353
mas "Pandan", id: 1569600264
