tap "glezseoane/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line launcher for macOS, in the spirit of `open`
brew "launch"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Zsh prompt for Astronauts
brew "spaceship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Lightweight BitTorrent client
brew "transmission-cli", restart_service: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Build, bundle & ship your Rust WASM application to the web
brew "trunk"
# Meta-level vim package manager
brew "volt"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application uninstaller
cask "appcleaner"
# Menu bar weather app
cask "datweatherdoe"
# Voice and text chat software
cask "discord"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance"
# Tools to protect your emails and files
cask "gpg-suite"
# Desktop automation application
cask "hammerspoon"
# Windows manager and desktop organiser
cask "hazeover"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Helps you learn to play your instrument
cask "melodics"
# Utility to move and zoom windows—on one display
cask "moom"
# All system and utility switches in one place
cask "one-switch"
# Digital audio production application
cask "reaper"
# Salesforce CLI tools
cask "sf"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Control windows and applications right from your trackpad
cask "swish"
# Quicklook extension for source files
cask "syntax-highlight"
# Unpacks archive files
cask "the-unarchiver"
# Automatic time and productivity tracking app
cask "timing"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
mas "Actions", id: 1586435171
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Barbee", id: 1548711022
mas "Consent-O-Matic", id: 1606897889
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "FastZip", id: 1565629813
mas "GarageBand", id: 682658836
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Home Assistant", id: 1099568401
mas "iCopy", id: 1638023723
mas "iRightMouse", id: 1497428978
mas "iShot", id: 1485844094
mas "Mapper", id: 1589391989
mas "Noir", id: 1592917505
mas "Paste", id: 967805235
mas "Photomator", id: 1444636541
mas "Signal Shifter", id: 6446061552
mas "Spaced", id: 1666327168
mas "Spotica Menu", id: 570549457
mas "StopTheMadness Pro", id: 6471380298
mas "Typist", id: 415166115
mas "Vimkey", id: 1585682577
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
vscode "aaron-bond.better-comments"
vscode "acrolinx.vscode-sidebar"
vscode "actboy168.lua-debug"
vscode "afractal.node-essentials"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "allemandinstable.colorful-comments-refreshed"
vscode "andrejunges.handlebars"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chuckjonas.apex-pmd"
vscode "codezombiech.gitignore"
vscode "compilouit.manpage"
vscode "ctf0.macros"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dqisme.sync-scroll"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "financialforce.lana"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "geeebe.duplicate"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gregorbiswanger.json2ts"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "inu1255.easy-snippet"
vscode "ivanhofer.git-assistant"
vscode "jabacchetta.vscode-essentials"
vscode "jakearl.search-editor-apply-changes"
vscode "jakewilson.vscode-picture"
vscode "jasonlhy.hungry-delete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnnymorganz.stylua"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "loiane.ts-extension-pack"
vscode "lolkush.quickstart"
vscode "lostintangent.vsls-whiteboard"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mechatroner.rainbow-csv"
vscode "meronz.manpages"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mulesoftinc.aml-vscode"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pdamianik.folder-archiver"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "philosowaffle.openapi-designer"
vscode "pkief.copy-branch-name"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "salesforce.analyticsdx-vscode"
vscode "salesforce.analyticsdx-vscode-core"
vscode "salesforce.analyticsdx-vscode-templates"
vscode "salesforce.commercedx-vscode"
vscode "salesforce.mule-dx-api-component"
vscode "salesforce.mule-dx-apikit-component"
vscode "salesforce.mule-dx-data-weave-client"
vscode "salesforce.mule-dx-dependencies"
vscode "salesforce.mule-dx-extension-pack"
vscode "salesforce.mule-dx-mule-dev-component"
vscode "salesforce.mule-dx-mule-runtime"
vscode "salesforce.mule-dx-vscode"
vscode "salesforce.salesforce-docs-markdown-preview"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-mobile"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdocs-markdown-assistant"
vscode "salesforce.sfdocs-vscode-extension-pack"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "salesforcebluecom.limitsmate"
vscode "salesforceorgopensourcecommons.open-source-commons"
vscode "sidthesloth.html5-boilerplate"
vscode "sj0000e.hexdiff"
vscode "sketchbuch.vsc-workspace-sidebar"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-multiclip"
vscode "sqrtt.prophet"
vscode "stkb.rewrap"
vscode "stringham.move-ts"
vscode "sumneko.lua"
vscode "svipas.control-snippets"
vscode "swellaby.common-pack"
vscode "swellaby.node-pack"
vscode "swellaby.workspace-config-plus"
vscode "tobiah.unity-tools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "unity.unity-debug"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "virgilsisoe.execute-in-iterm2"
vscode "virgilsisoe.hammerspoon"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "virgilsisoe.toggle-snippets-suggestion"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "walkme.html5-extension-pack"
vscode "willmendesneto.vscode-file-extra"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
