tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "readline"
brew "adb-enhanced"
brew "bat"
brew "cascadia"
brew "diff-so-fancy"
brew "direnv"
brew "folderify"
brew "font-util"
brew "fpp"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "jq"
brew "launch"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "mackup"
brew "mas"
brew "mods"
brew "mosh"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openjdk@11"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "rust"
brew "shfmt"
brew "spaceship"
brew "stylua"
brew "terminal-notifier"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "transcrypt"
brew "transmission-cli"
brew "tree"
brew "trunk"
brew "xmlstarlet"
brew "yadm"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "qmk/qmk/qmk"
cask "dotnet-sdk"
cask "flickr-uploadr"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "hammerspoon"
cask "hazeover"
cask "intellij-idea"
cask "intune-company-portal"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logitune"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "moom"
cask "onedrive"
cask "sf"
cask "spotify"
cask "steam"
cask "swift-quit"
cask "the-unarchiver"
cask "transmission"
cask "via"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "com.epg.hassapp", id: 1451449886
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "Keys Multiplatform", id: 1494642810
mas "Mapper", id: 1589391989
mas "Paste", id: 967805235
mas "Posture Pal", id: 1590316152
mas "Sequence Diagram", id: 1195426709
mas "Slack", id: 803453959
mas "Snap", id: 418073146
mas "StopTheMadness", id: 1376402589
mas "Typist", id: 415166115
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
vscode "aaron-bond.better-comments"
vscode "acrolinx.vscode-sidebar"
vscode "actboy168.extension-path"
vscode "actboy168.lua-debug"
vscode "actboy168.tasks"
vscode "afractal.node-essentials"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "allemandinstable.colorful-comments-refreshed"
vscode "andrejunges.handlebars"
vscode "atishay-jain.all-autocomplete"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chuckjonas.apex-pmd"
vscode "codestream.codestream"
vscode "codezombiech.gitignore"
vscode "compilouit.manpage"
vscode "ctf0.macros"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dqisme.sync-scroll"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "financialforce.lana"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "geeebe.duplicate"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gregorbiswanger.json2ts"
vscode "gruntfuggly.todo-tree"
vscode "hoovercj.vscode-settings-cycler"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "inu1255.easy-snippet"
vscode "ionutvmi.path-autocomplete"
vscode "ivanhofer.git-assistant"
vscode "jabacchetta.vscode-essentials"
vscode "jakearl.search-editor-apply-changes"
vscode "jakewilson.vscode-picture"
vscode "jasonlhy.hungry-delete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "johnnymorganz.stylua"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "loiane.ts-extension-pack"
vscode "lolkush.quickstart"
vscode "lostintangent.vsls-whiteboard"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mechatroner.rainbow-csv"
vscode "meronz.manpages"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mulesoftinc.aml-vscode"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pdamianik.folder-archiver"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "philosowaffle.openapi-designer"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "postman.postman-for-vscode"
vscode "quantum.qsharp-lang-vscode"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "salesforce.analyticsdx-vscode"
vscode "salesforce.analyticsdx-vscode-core"
vscode "salesforce.analyticsdx-vscode-templates"
vscode "salesforce.codey-high-noon"
vscode "salesforce.codey-midnight"
vscode "salesforce.commercedx-vscode"
vscode "salesforce.mule-dx-api-component"
vscode "salesforce.mule-dx-apikit-component"
vscode "salesforce.mule-dx-data-weave-client"
vscode "salesforce.mule-dx-dependencies"
vscode "salesforce.mule-dx-extension-pack"
vscode "salesforce.mule-dx-mule-dev-component"
vscode "salesforce.mule-dx-mule-runtime"
vscode "salesforce.mule-dx-vscode"
vscode "salesforce.salesforce-docs-markdown-preview"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-mobile"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdocs-markdown-assistant"
vscode "salesforce.sfdocs-vscode-extension-pack"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "salesforcebluecom.limitsmate"
vscode "salesforceorgopensourcecommons.open-source-commons"
vscode "sidthesloth.html5-boilerplate"
vscode "sj0000e.hexdiff"
vscode "sketchbuch.vsc-workspace-sidebar"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-multiclip"
vscode "sqrtt.prophet"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "sumneko.lua"
vscode "svipas.control-snippets"
vscode "swellaby.common-pack"
vscode "swellaby.node-pack"
vscode "swellaby.workspace-config-plus"
vscode "tobiah.unity-tools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "unity.unity-debug"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "virgilsisoe.execute-in-iterm2"
vscode "virgilsisoe.hammerspoon"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "virgilsisoe.toggle-snippets-suggestion"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.gistfs"
vscode "walkme.html5-extension-pack"
vscode "willmendesneto.vscode-file-extra"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
